// Масиви та об'єкти:
// - Створити масив, наповнити його 10 елементами будь-якого типу, вивести кожен елемент в консоль
let arrayOfElements = [`ToyotaSupra`, `Nissan180SX`, `HondaCivic`, `MazdaRX-7`, 1, 1.01, true, false, undefined, 99.99];
console.log(arrayOfElements);
// - Створити 3 об'єкти які описують книги. Поля об'єкту : title ,pageCount, genre.
let books = [
    {title: `Фактор Черчилля. Як одна людина змінила історію`, pageCount: 500, genre: history},
    {title: `Довга Хода`, pageCount: 288, genre: `history`},
    {title: `Двір холоду і зоряного сяйва.`, pageCount: 256, genre: `fantasy`}
];

// - Створити 3 об'єкти які описують книги.
// Поля об'єкту : title ,pageCount, genre, authors.
// Поле "автори" - являється  масивом. Кожен автор має поля name та age.

let books2 = [
    {
        title: `Володар перснів`,
        pageCount: 1120,
        genre: `fantasy`,
        // у завдані пише що автори це масив ... але присвоювати через = не доречно ...
        // то ж я розумію , що тут краще викристати об'єкт ??? Чи все таки так як закоментований код нище ?
        // authors1: [name = `Джон Р. Р. Толкін` , age = `99`] ;
        authors: {name: `Джон Р. Р. Толкін`, age: 99}
    },
    {
        title: `Колгосп тварин`,
        pageCount: 128,
        genre: `classic`,
        authors: {name: `Джордж Орвел`, age: 99}
    },
    {
        title: `Старий і море`,
        pageCount: 104,
        genre: `classic`,
        authors: {name: `Ернест Гемінґвей` , age: 99}
    }
];

// - Створити масив з 10 об'єктами які описують сутніть "користувач". Поля: name, username,password. Вивести в консоль пароль кожного користувача
//
//
// Логічні розгалуження:
//     - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).
//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.
//
//     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподібні, тобто приводиться до false)
//
//
//     - з файлу arrays.js (лежить в папці 2023 plan ) взяти масив coursesAndDurationArray. За допомоги іф перевірити кожен його елемент на тривалість навчання. У випадку якщо тривалість довша за 5 місяців вивести в консоль "Супер".